const doa = [
	{
		nama : "عند الافطار",
		arab : "اَللّهُمَّ لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ بِرَحْمَتِكَ يَا اَرْحَمَ الرَّحِمِيْنَ",
		latin : "Allahumma laka shumtu wa bika amantu wa'ala rizqika afthartu. Birrahmatika yaa arhamar roohimin.",
		indo : "Ya Allah, untuk Mu aku berpuasa, dan kepada Mu aku beriman, dan dengan rezeki Mu aku berbuka. Dengan rahmat Mu wahai yang Maha Pengasih dan Penyayang.",
		warna : 1
	},
	{
		nama : "قبل الصلاة",
		arab : "اَللّٰهُمَّ بَارِكْ لَنَا فِيْمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ",
		latin : "Alloohumma barik lanaa fiimaa razatanaa waqinaa 'adzaa bannar",
		indo : "Ya Allah, berkahilah kami dalam rezeki yang telah Engkau berikan kepada kami dan peliharalah kami dari siksa api neraka",
		warna : 1
	},
	{
		nama : "بعد تناول الطعام",
		arab : "اَلْحَمْدُ ِللهِ الَّذِىْ اَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِيْنَ",
		latin : "Alhamdu lillaahil ladzii ath'amanaa wa saqoonaa wa ja'alnaa muslimiin",
		indo : "Segala puji bagi Allah yang telah memberi makan kami dan minuman kami, serta menjadikan kami sebagai orang-orang islam",
		warna : 1
	},
	{
		nama : "عند نسيان البسملة في بداية الطعام",
		arab : "بِسْمِ اللهِ فِىِ أَوَّلِهِ وَآخِرِهِ",
		latin : "Bismillaahi fii awwalihi wa aakhirihi",
		indo : "Dengan menyebut nama Allah pada awal dan akhirnya",
		warna: 1
	},
	{
		nama : " قبل النوم ",
		arab : "باسمك اللهم أموت وأحيا اللهم أسلمت نفسي إليك وفوّضت أمري إليك وألجأت ظهري إليك رغبةً ورهبةً إليك لا ملجأ ولا منجى منك إلاّ إليك آمنت بكتابك الذي أنزلت ونبيّك الذي أرسلت الحمد لله الذي أطعمني وسقاني والحمد لله الذي منّ عليّ فأفضل",
		latin : "Bismikallohumma ahya wa amuutu",
		indo : "Dengan menyebut nama-Mu ya Allah, aku hidup dan aku mati",
		warna : 1
	},
	{
		nama : " قبل دخول الحمام",
		arab : "اَللّٰهُمَّ اِنّىْ اَعُوْذُبِكَ مِنَ الْخُبُثِ وَالْخَبَآئِثِ",
		latin : "Alloohumma Innii a'uudzubika minal khubutsi wal khoaaitsi",
		indo : "Ya Allah, aku berlindung pada-Mu dari godaan syetan  laki-laki dan setan perempuan",
		warna : 1
	},

	{
		nama : "في اول الطعام",
		arab : " الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة، الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين، الحمد لله الذي أطعم وسقى، وسوغه وجعل له مخرجًا ...",
		warna : 1
	},

	{
		
		nama : "الصباح",
		arab : " اللهمّ إنّي أسألك العافيةَ في الدُنيا والآخرة، اللهمّ إنّي أسألك العفوَ والعافيةَ في ديني ودُنياي وأهلي ومالي، اللهمّ استر عوراتي وآمن رَوْعَاتي، اللهمّ احفظني مِن بين يَدَيَّ ومِن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذُ بعظمتِك أن أُغتاَل مِن تحتي).",
		warna : 1
	},

	{
		
		nama : " السفر",
		arab : "اللهم نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم أنت الصاحب في السفر والخليفة في الأهل والمال والولد اللهم يسر ولا تعسر اللهم هون علينا سفرنا هذا وأطو عنا بعده لا إله الا الله محمد رسول الله وما بكم من نعمة فمن الله والحمد لله والشكر لله وحده ",
		warna : 1
	},

	{
		
		nama : " قبل الفجر",
		arab : " اللهم افتح لنا فتحا مبينًا، واهدنا صراطًا مستقيمًا، وانصرنا نصرًا عزيزًا. اللهم إني أسألك في صلاتي ودعائي بركة تطهر بها قلبي، وتكشف بها كربي، وتغفر بها ذنبي وتصلح بها أمري، وتغني بها فقري، وتذهب بها شري، وتكشف بها همي وغمي، وتشفي بها سقمي، وتقضي بها ديني، وتجلو بها حزني، وتجمع بها شملي، وتبيض بها وجهي. ",
		warna : 1
	},

	{
		
		nama : " قضاء الحاجة  ",
		arab : "يا عِمادَ مَنْ لا عِمادَ لَهُ، ويا ذُخْرَ مَنْ لا ذُخْرَ لَهُ، وَيا سَنَدَ مَنْ لا سَنَدَ لَهُ، ويا حِرْزَ مَنْ لا حِرْزَ لَهُ، وَيا غِياثَ مَنْ لا غِياثَ لَهُ، وَيا كَنْزَ مَنْ لا كَنْزَ لَهُ، وَيا عِزَّ مَنْ لا عِزَّ لَهُ، يا كَريمَ الْعَفْوِ، يا حَسَنَ التَّجاوُزِ، يا عَوْنَ الضُّعَفاءِ، يا كَنْزَ الْفُقَراءِ، يا عَظيمَ الَّرجاءِ، يا مُنْقِذَ الْغَرْقى، يا مُنْجِيَ الْهَلْكى، يا مُحْسِنُ، يا مُجْمِلُ، يا مُنْعِمُ، يا مُفْضِلُ، اَنْتَ الَّذي سَجَدَ لَكَ سَوادُ اللّيْلِ وَنُورُ النَّهارِ وَضوْءُ الْقَمَرِ، وَشُعاعُ الشَّمْسِ، وَحَفيفُ الشَّجَرِ، وَدَوِىُّ الْماءِ، يا اَللهُ يا اَللهُ يا اَللهُ لا اِلـهَ إلاّ اَنْتَ وَحْدَكَ لا شَريكَ لَكَ، يا رَبّاهُ يا اَللهُ، صَلِّ عَلى مُحَمَّد وآلِ مُحَمَّد وَافْعَلْ بِنا ما اَنْتَ اَهْلُهُ . ثمّ سل حاجتك ",
		warna : 1
	},

	{
		
		nama : " ألشفاء ",
	    arab : "اللهم إنا نسألك بأسمائك الحسنى وبصفاتك العلا وبرحمتك التي وسعت كلّ شيء، أن تمنّ علينا بالشفاء العاجل، وألّا تدع فينا جرحًا إلّا داويته، ولا ألمًا إلا سكنته، ولا مرضًا إلا شفيته، وألبسنا ثوب الصحة والعافية عاجلًا غير آجل، وشافِنا وعافِنا واعف عنا، واشملنا بعطفك ومغفرتك، وتولّنا برحمتك يا أرحم الراحمين" ,
	    warna : 1
	}

];